## <span style="color:red"> PANDAS </span>

***

### <span style="color:orange">(DAY-11)</span>

---

***

In [2]:
# import Libraries !
import pandas as pd
import numpy as np

In [466]:
a = pd.array([1, 2, np.nan, 5, 6, 7, 2, 4, 9])
a

<IntegerArray>
[1, 2, <NA>, 5, 6, 7, 2, 4, 9]
Length: 9, dtype: Int64

In [467]:
a = pd.Series(a) # Columns
a

0       1
1       2
2    <NA>
3       5
4       6
5       7
6       2
7       4
8       9
dtype: Int64

---

In [468]:
b = pd.Series([1, 2, np.nan, 5, 6, 7, 2, 4, 9]) # Columns
b

0    1.0
1    2.0
2    NaN
3    5.0
4    6.0
5    7.0
6    2.0
7    4.0
8    9.0
dtype: float64

In [469]:
b = pd.array(b)
b

<PandasArray>
[1.0, 2.0, nan, 5.0, 6.0, 7.0, 2.0, 4.0, 9.0]
Length: 9, dtype: float64

In [470]:
dates = pd.date_range("20220101", periods=10) # dates
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [471]:
# df stands data-frame contains both (Rows & Columns) !
df = pd.DataFrame(np.random.randn(10,5),
                     index=dates,
                     columns=list("FAHAD"),
                     dtype="float64")

df

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084

In [472]:
df.dtypes

F    float64
A    float64
H    float64
A    float64
D    float64
dtype: object

In [473]:
df1 = pd.DataFrame(
    {
        "A": 42.0,
        "B": pd.date_range("20220101", periods=5),
        "C": pd.Series(1, index=list(range(5)), dtype="float32"),
        "D": np.array([2] * 5, dtype="int32"),  
        "E": pd.Categorical(["Male", "Female", "Male", "Female","Male"]),
        "F": "Human",
        "G": np.array([1,2,3,5,6]),
        "H": pd.Timestamp("20220131")
    }
)
df1

      A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31

In [474]:
df1.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G             int32
H    datetime64[ns]
dtype: object

In [475]:
df1.head(2)

      A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31

In [476]:
df1.tail(2)

      A          B    C  D       E      F  G          H
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31

In [477]:
df1.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [478]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [479]:
df.to_numpy

<bound method DataFrame.to_numpy of                    F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084>

In [480]:
df1.to_numpy

<bound method DataFrame.to_numpy of       A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31>

In [481]:
df.describe()

               F          A          H          A          D
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.043417   0.053948   0.224763  -0.308465   0.254680
std     1.292778   0.992448   0.681304   1.118038   1.001364
min    -1.489820  -1.436199  -1.049753  -2.559111  -1.303819
25%    -1.048215  -0.557727  -0.030691  -1.045691  -0.483815
50%    -0.109940   0.243672   0.215270   0.157131   0.675270
75%     0.724237   0.500049   0.471880   0.346107   0.921425
max     2.149851   1.580300   1.650960   1.037855   1.610061

In [482]:
df1.describe()

          A    C    D         G
count   5.0  5.0  5.0  5.000000
mean   42.0  1.0  2.0  3.400000
std     0.0  0.0  0.0  2.073644
min    42.0  1.0  2.0  1.000000
25%    42.0  1.0  2.0  2.000000
50%    42.0  1.0  2.0  3.000000
75%    42.0  1.0  2.0  5.000000
max    42.0  1.0  2.0  6.000000

In [483]:
# Transpose of Dataset !
df1.T

,0,1,2,3,4
A,42.0,42.0,42.0,42.0,42.0
B,2022-01-01 00:00:00,2022-01-02 00:00:00,2022-01-03 00:00:00,2022-01-04 00:00:00,2022-01-05 00:00:00
C,1.0,1.0,1.0,1.0,1.0
D,2,2,2,2,2
E,Male,Female,Male,Female,Male
F,Human,Human,Human,Human,Human
G,1,2,3,5,6
H,2022-01-31 00:00:00,2022-01-31 00:00:00,2022-01-31 00:00:00,2022-01-31 00:00:00,2022-01-31 00:00:00

In [484]:
df1

      A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31

In [485]:
# FALSE contains Descending output !
df1.sort_index(axis=0, ascending=False)

      A          B    C  D       E      F  G          H
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31

In [486]:
# TRUE contains Ascending output !
df1.sort_index(axis=0, ascending=True)

      A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31
3  42.0 2022-01-04  1.0  2  Female  Human  5 2022-01-31
4  42.0 2022-01-05  1.0  2    Male  Human  6 2022-01-31

In [487]:
df1["E"] # Specific Columns

0      Male
1    Female
2      Male
3    Female
4      Male
Name: E, dtype: category
Categories (2, object): ['Female', 'Male']

In [488]:
df

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084

In [489]:
# sort by specific value !
df.sort_values(by="F")

                   F         A         H         A         D
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539

In [490]:
df["D"].head()

2022-01-01    1.610061
2022-01-02    0.905373
2022-01-03   -1.211028
2022-01-04    0.817330
2022-01-05   -0.632539
Freq: D, Name: D, dtype: float64

In [491]:
df[0:]

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084

In [492]:
df[:3]

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028

In [493]:
df[0:5]

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539

In [494]:
df1[:3]

      A          B    C  D       E      F  G          H
0  42.0 2022-01-01  1.0  2    Male  Human  1 2022-01-31
1  42.0 2022-01-02  1.0  2  Female  Human  2 2022-01-31
2  42.0 2022-01-03  1.0  2    Male  Human  3 2022-01-31

In [495]:
# row-wise selection !
df.loc[dates[0]]

F    1.941789
A   -0.749259
H    0.483280
A    1.037855
D    1.610061
Name: 2022-01-01 00:00:00, dtype: float64

In [496]:
df.loc[dates[6]]

F   -1.130552
A   -1.415366
H    0.437683
A    0.309348
D   -0.037643
Name: 2022-01-07 00:00:00, dtype: float64

In [497]:
df.loc[dates[2:3]]

                   F         A         H         A         D
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028

In [498]:
df.loc[["20220106", "20220108"],["H","D"]]

                   H         D
2022-01-06  0.505371 -1.303819
2022-01-08  1.650960  0.533211

In [499]:
df.loc["20220106":"20220108",["H","D","F"]]

                   H         D         F
2022-01-06  0.505371 -1.303819 -0.117731
2022-01-07  0.437683 -0.037643 -1.130552
2022-01-08  1.650960  0.533211 -1.489820

In [500]:
df.loc["20220103",["H","D","F"]]

H   -0.247524
D   -1.211028
F   -1.279575
Name: 2022-01-03 00:00:00, dtype: float64

In [501]:
df.loc["20220103"]

F   -1.279575
A    1.078934
H   -0.247524
A   -0.721753
D   -1.211028
Name: 2022-01-03 00:00:00, dtype: float64

In [502]:
# at this specific date !
df.at[dates[5], "H"]

0.5053705872708028

In [503]:
df.iloc[0:2, [2,3]]

                   H         A
2022-01-01  0.483280  1.037855
2022-01-02  0.232038 -2.559111

In [504]:
df.iloc[2:6, 3:5]

                   A         D
2022-01-03 -0.721753 -1.211028
2022-01-04  0.098321  0.817330
2022-01-05  0.215942 -0.632539
2022-01-06  0.718282 -1.303819

In [505]:
df.iloc[:2, 1:3]

                   A         H
2022-01-01 -0.749259  0.483280
2022-01-02  0.181746  0.232038

In [506]:
df.iloc[2:4, :4]

                   F         A         H         A
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753
2022-01-04 -0.102150  1.580300 -0.079918  0.098321

In [507]:
df.head(2)

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373

In [508]:
df[df["H"] > 1]

                  F         A        H        A         D
2022-01-08 -1.48982  0.016868  1.65096 -1.15367  0.533211

In [509]:
df[df < 0]

                   F         A         H         A         D
2022-01-01       NaN -0.749259       NaN       NaN       NaN
2022-01-02       NaN       NaN       NaN -2.559111       NaN
2022-01-03 -1.279575       NaN -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150       NaN -0.079918       NaN       NaN
2022-01-05       NaN       NaN       NaN       NaN -0.632539
2022-01-06 -0.117731       NaN       NaN       NaN -1.303819
2022-01-07 -1.130552 -1.415366       NaN       NaN -0.037643
2022-01-08 -1.489820       NaN       NaN -1.153670       NaN
2022-01-09 -0.801204 -1.436199       NaN -1.388226       NaN
2022-01-10       NaN       NaN -1.049753       NaN       NaN

In [510]:
df1 = df.copy()
df1

                   F         A         H         A         D
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084

In [511]:
df1["new"] = ["a", "b", "c", "d","a", "b", "c", "d","e","f"]
df1

                   F         A         H         A         D new
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061   a
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373   b
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028   c
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330   d
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539   a
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819   b
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643   c
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211   d
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775   e
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084   f

In [512]:
df1["mean"] = [1,2,3,4,5,2,3,4,5,1]
df1

                   F         A         H         A         D new  mean
2022-01-01  1.941789 -0.749259  0.483280  1.037855  1.610061   a     1
2022-01-02  0.816694  0.181746  0.232038 -2.559111  0.905373   b     2
2022-01-03 -1.279575  1.078934 -0.247524 -0.721753 -1.211028   c     3
2022-01-04 -0.102150  1.580300 -0.079918  0.098321  0.817330   d     4
2022-01-05  2.149851  0.511669  0.198502  0.215942 -0.632539   a     5
2022-01-06 -0.117731  0.305599  0.505371  0.718282 -1.303819   b     2
2022-01-07 -1.130552 -1.415366  0.437683  0.309348 -0.037643   c     3
2022-01-08 -1.489820  0.016868  1.650960 -1.153670  0.533211   d     4
2022-01-09 -0.801204 -1.436199  0.116991 -1.388226  0.926775   e     5
2022-01-10  0.446865  0.465188 -1.049753  0.358360  0.939084   f     1

In [513]:
df1 = df1.iloc[2:5, 5:7] # Near Specific Locate !

In [514]:
df1

           new  mean
2022-01-03   c     3
2022-01-04   d     4
2022-01-05   a     5

---

---